QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB14def.inc
;***** THIS IS A MACHINE GENERATED FILE - DO NOT EDIT ********************

;*************************************************************************
;* A P P L I C A T I O N   N O T E   F O R   T H E   A V R   F A M I L Y
;*
;* Number            : AVR000
;* File Name         : AVR16EB14def.inc
;* Title             : Register/Bit Definitions for the AVR16EB14
;* Created           : 2023-06-26 11:39
;* Version           : 1.00
;* Support           : https://microchipsupport.force.com/
;* Target MCU        : AVR16EB14
;*
;* DESCRIPTION
;* When including this file in the assembly program file, all I/O register
;* names and I/O register bit names appearing in the data book can be used.
;* In addition, the six registers forming the three data pointers X, Y and
;* Z have been assigned names XL - ZH. Highest RAM address for Internal
;* SRAM is also defined
;*
;*************************************************************************

#ifndef _AVR16EB14DEF_INC_
#define _AVR16EB14DEF_INC_


#pragma partinc 0

; ***** SPECIFY DEVICE ***************************************************
.device	AVR16EB14

#pragma AVRPART ADMIN PART_NAME AVR16EB14

.equ	SIGNATURE_000	= 0x1E
.equ	SIGNATURE_001	= 0x94
.equ	SIGNATURE_002	= 0x49

#pragma AVRPART CORE CORE_VERSION V4S


; ***** ABSOLUTE I/O REGISTER LOCATIONS **********************************


;*************************************************************************
;** AC0 - Analog Comparator
;*************************************************************************

.equ AC0_CTRLA = 0x0680                  ; Control A
.equ AC0_CTRLB = 0x0681                  ; Control B
.equ AC0_MUXCTRL = 0x0682                ; Mux Control A
.equ AC0_DACREF = 0x0685                 ; DAC Voltage Reference
.equ AC0_INTCTRL = 0x0686                ; Interrupt Control
.equ AC0_STATUS = 0x0687                 ; Status

;*************************************************************************
;** AC1 - Analog Comparator
;*************************************************************************

.equ AC1_CTRLA = 0x0688                  ; Control A
.equ AC1_CTRLB = 0x0689                  ; Control B
.equ AC1_MUXCTRL = 0x068A                ; Mux Control A
.equ AC1_DACREF = 0x068D                 ; DAC Voltage Reference
.equ AC1_INTCTRL = 0x068E                ; Interrupt Control
.equ AC1_STATUS = 0x068F                 ; Status

;*************************************************************************
;** ADC0 - Analog to Digital Converter
;*************************************************************************

.equ ADC0_CTRLA = 0x0600                 ; Control A
.equ ADC0_CTRLB = 0x0601                 ; Control B
.equ ADC0_CTRLC = 0x0602                 ; Control C
.equ ADC0_CTRLD = 0x0603                 ; Control D
.equ ADC0_INTCTRL = 0x0604               ; Interrupt Control
.equ ADC0_INTFLAGS = 0x0605              ; Interrupt Flags
.equ ADC0_STATUS = 0x0606                ; Status register
.equ ADC0_DBGCTRL = 0x0607               ; Debug Control
.equ ADC0_CTRLE = 0x0608                 ; Control E
.equ ADC0_CTRLF = 0x0609                 ; Control F
.equ ADC0_COMMAND = 0x060A               ; Command register
.equ ADC0_PGACTRL = 0x060B               ; PGA Control
.equ ADC0_MUXPOS = 0x060C                ; Positive Input Multiplexer
.equ ADC0_MUXNEG = 0x060D                ; Negative Input Multiplexer
.equ ADC0_RESULT = 0x0610                ; Result
.equ ADC0_RESULT0 = 0x0610               ; Result 0
.equ ADC0_RESULT1 = 0x0611               ; Result 1
.equ ADC0_RESULT2 = 0x0612               ; Result 2
.equ ADC0_RESULT3 = 0x0613               ; Result 3
.equ ADC0_SAMPLE = 0x0614                ; Sample
.equ ADC0_SAMPLEL = 0x0614               ; Sample low byte
.equ ADC0_SAMPLEH = 0x0615               ; Sample hi byte
.equ ADC0_TEMP0 = 0x0618                 ; Temporary Data 0
.equ ADC0_TEMP1 = 0x0619                 ; Temporary Data 1
.equ ADC0_TEMP2 = 0x061A                 ; Temporary Data 2
.equ ADC0_WINLT = 0x061C                 ; Window Low Threshold
.equ ADC0_WINLTL = 0x061C                ; Window Low Threshold low byte
.equ ADC0_WINLTH = 0x061D                ; Window Low Threshold hi byte
.equ ADC0_WINHT = 0x061E                 ; Window High Threshold
.equ ADC0_WINHTL = 0x061E                ; Window High Threshold low byte
.equ ADC0_WINHTH = 0x061F                ; Window High Threshold hi byte

;*************************************************************************
;** BOD - Bod interface
;*************************************************************************

.equ BOD_CTRLA = 0x00A0                  ; Control A
.equ BOD_CTRLB = 0x00A1                  ; Control B
.equ BOD_VLMCTRLA = 0x00A8               ; Voltage level monitor Control
.equ BOD_INTCTRL = 0x00A9                ; Voltage level monitor interrupt Control
.equ BOD_INTFLAGS = 0x00AA               ; Voltage level monitor interrupt Flags
.equ BOD_STATUS = 0x00AB                 ; Voltage level monitor status

;*************************************************************************
;** BOOTROW - Boot Row
;*************************************************************************

.equ BOOTROW_BOOTROW0 = 0x1100           ; Boot Row 0
.equ BOOTROW_BOOTROW1 = 0x1101           ; Boot Row 1
.equ BOOTROW_BOOTROW2 = 0x1102           ; Boot Row 2
.equ BOOTROW_BOOTROW3 = 0x1103           ; Boot Row 3
.equ BOOTROW_BOOTROW4 = 0x1104           ; Boot Row 4
.equ BOOTROW_BOOTROW5 = 0x1105           ; Boot Row 5
.equ BOOTROW_BOOTROW6 = 0x1106           ; Boot Row 6
.equ BOOTROW_BOOTROW7 = 0x1107           ; Boot Row 7
.equ BOOTROW_BOOTROW8 = 0x1108           ; Boot Row 8
.equ BOOTROW_BOOTROW9 = 0x1109           ; Boot Row 9
.equ BOOTROW_BOOTROW10 = 0x110A          ; Boot Row 10
.equ BOOTROW_BOOTROW11 = 0x110B          ; Boot Row 11
.equ BOOTROW_BOOTROW12 = 0x110C          ; Boot Row 12
.equ BOOTROW_BOOTROW13 = 0x110D          ; Boot Row 13
.equ BOOTROW_BOOTROW14 = 0x110E          ; Boot Row 14
.equ BOOTROW_BOOTROW15 = 0x110F          ; Boot Row 15
.equ BOOTROW_BOOTROW16 = 0x1110          ; Boot Row 16
.equ BOOTROW_BOOTROW17 = 0x1111          ; Boot Row 17
.equ BOOTROW_BOOTROW18 = 0x1112          ; Boot Row 18
.equ BOOTROW_BOOTROW19 = 0x1113          ; Boot Row 19
.equ BOOTROW_BOOTROW20 = 0x1114          ; Boot Row 20
.equ BOOTROW_BOOTROW21 = 0x1115          ; Boot Row 21
.equ BOOTROW_BOOTROW22 = 0x1116          ; Boot Row 22
.equ BOOTROW_BOOTROW23 = 0x1117          ; Boot Row 23
.equ BOOTROW_BOOTROW24 = 0x1118          ; Boot Row 24
.equ BOOTROW_BOOTROW25 = 0x1119          ; Boot Row 25
.equ BOOTROW_BOOTROW26 = 0x111A          ; Boot Row 26
.equ BOOTROW_BOOTROW27 = 0x111B          ; Boot Row 27
.equ BOOTROW_BOOTROW28 = 0x111C          ; Boot Row 28
.equ BOOTROW_BOOTROW29 = 0x111D          ; Boot Row 29
.equ BOOTROW_BOOTROW30 = 0x111E          ; Boot Row 30
.equ BOOTROW_BOOTROW31 = 0x111F          ; Boot Row 31
.equ BOOTROW_BOOTROW32 = 0x1120          ; Boot Row 32
.equ BOOTROW_BOOTROW33 = 0x1121          ; Boot Row 33
.equ BOOTROW_BOOTROW34 = 0x1122          ; Boot Row 34
.equ BOOTROW_BOOTROW35 = 0x1123          ; Boot Row 35
.equ BOOTROW_BOOTROW36 = 0x1124          ; Boot Row 36
.equ BOOTROW_BOOTROW37 = 0x1125          ; Boot Row 37
.equ BOOTROW_BOOTROW38 = 0x1126          ; Boot Row 38
.equ BOOTROW_BOOTROW39 = 0x1127          ; Boot Row 39
.equ BOOTROW_BOOTROW40 = 0x1128          ; Boot Row 40
.equ BOOTROW_BOOTROW41 = 0x1129          ; Boot Row 41
.equ BOOTROW_BOOTROW42 = 0x112A          ; Boot Row 42
.equ BOOTROW_BOOTROW43 = 0x112B          ; Boot Row 43
.equ BOOTROW_BOOTROW44 = 0x112C          ; Boot Row 44
.equ BOOTROW_BOOTROW45 = 0x112D          ; Boot Row 45
.equ BOOTROW_BOOTROW46 = 0x112E          ; Boot Row 46
.equ BOOTROW_BOOTROW47 = 0x112F          ; Boot Row 47
.equ BOOTROW_BOOTROW48 = 0x1130          ; Boot Row 48
.equ BOOTROW_BOOTROW49 = 0x1131          ; Boot Row 49
.equ BOOTROW_BOOTROW50 = 0x1132          ; Boot Row 50
.equ BOOTROW_BOOTROW51 = 0x1133          ; Boot Row 51
.equ BOOTROW_BOOTROW52 = 0x1134          ; Boot Row 52
.equ BOOTROW_BOOTROW53 = 0x1135          ; Boot Row 53
.equ BOOTROW_BOOTROW54 = 0x1136          ; Boot Row 54
.equ BOOTROW_BOOTROW55 = 0x1137          ; Boot Row 55
.equ BOOTROW_BOOTROW56 = 0x1138          ; Boot Row 56
.equ BOOTROW_BOOTROW57 = 0x1139          ; Boot Row 57
.equ BOOTROW_BOOTROW58 = 0x113A          ; Boot Row 58
.equ BOOTROW_BOOTROW59 = 0x113B          ; Boot Row 59
.equ BOOTROW_BOOTROW60 = 0x113C          ; Boot Row 60
.equ BOOTROW_BOOTROW61 = 0x113D          ; Boot Row 61
.equ BOOTROW_BOOTROW62 = 0x113E          ; Boot Row 62
.equ BOOTROW_BOOTROW63 = 0x113F          ; Boot Row 63

;*************************************************************************
;** CCL - Configurable Custom Logic
;*************************************************************************

