QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB14def.inc
; Start command select
.equ ADC_START_STOP_gc = (0x00<<0)       ; Stop an ongoing conversion
.equ ADC_START_IMMEDIATE_gc = (0x01<<0)  ; Start a conversion immediately. This will be set back to STOP when the first conversion is done, unless Free-Running mode is enabled
.equ ADC_START_MUXPOS_WRITE_gc = (0x02<<0) ; Start when MUXPOS register is written
.equ ADC_START_MUXNEG_WRITE_gc = (0x03<<0) ; Start when MUXNEG register is written
.equ ADC_START_EVENT_TRIGGER_gc = (0x04<<0) ; Start when an event is received

; Prescaler Value select
.equ ADC_PRESC_DIV2_gc = (0x00<<0)       ; System clock divided by 2
.equ ADC_PRESC_DIV4_gc = (0x01<<0)       ; System clock divided by 4
.equ ADC_PRESC_DIV6_gc = (0x02<<0)       ; System clock divided by 6
.equ ADC_PRESC_DIV8_gc = (0x03<<0)       ; System clock divided by 8
.equ ADC_PRESC_DIV10_gc = (0x04<<0)      ; System clock divided by 10
.equ ADC_PRESC_DIV12_gc = (0x05<<0)      ; System clock divided by 12
.equ ADC_PRESC_DIV14_gc = (0x06<<0)      ; System clock divided by 14
.equ ADC_PRESC_DIV16_gc = (0x07<<0)      ; System clock divided by 16
.equ ADC_PRESC_DIV20_gc = (0x08<<0)      ; System clock divided by 20
.equ ADC_PRESC_DIV24_gc = (0x09<<0)      ; System clock divided by 24
.equ ADC_PRESC_DIV28_gc = (0x0A<<0)      ; System clock divided by 28
.equ ADC_PRESC_DIV32_gc = (0x0B<<0)      ; System clock divided by 32
.equ ADC_PRESC_DIV40_gc = (0x0C<<0)      ; System clock divided by 40
.equ ADC_PRESC_DIV48_gc = (0x0D<<0)      ; System clock divided by 48
.equ ADC_PRESC_DIV56_gc = (0x0E<<0)      ; System clock divided by 56
.equ ADC_PRESC_DIV64_gc = (0x0F<<0)      ; System clock divided by 64

; Reference select
.equ ADC_REFSEL_VDD_gc = (0x00<<0)       ; VDD
.equ ADC_REFSEL_VREFA_gc = (0x02<<0)     ; External Reference
.equ ADC_REFSEL_1V024_gc = (0x04<<0)     ; Internal 1.024V Reference
.equ ADC_REFSEL_2V048_gc = (0x05<<0)     ; Internal 2.048V Reference
.equ ADC_REFSEL_4V096_gc = (0x06<<0)     ; Internal 4.096V Reference
.equ ADC_REFSEL_2V500_gc = (0x07<<0)     ; Internal 2.500V Reference

; Window Comparator Mode select
.equ ADC_WINCM_NONE_gc = (0x00<<0)       ; No Window Comparison
.equ ADC_WINCM_BELOW_gc = (0x01<<0)      ; Below Window
.equ ADC_WINCM_ABOVE_gc = (0x02<<0)      ; Above Window
.equ ADC_WINCM_INSIDE_gc = (0x03<<0)     ; Inside Window
.equ ADC_WINCM_OUTSIDE_gc = (0x04<<0)    ; Outside Window

; Window Mode Source select
.equ ADC_WINSRC_RESULT_gc = (0x00<<3)    ; Result register used as Window Comparator Source
.equ ADC_WINSRC_SAMPLE_gc = (0x01<<3)    ; Sample register used as Window Comparator Source

; Sign Chopping select
.equ ADC_CHOPPING_DISABLE_gc = (0x00<<6) ; Sign Chopping Disabled
.equ ADC_CHOPPING_ENABLE_gc = (0x01<<6)  ; Sign Chopping Enabled

; Sample numbers select
.equ ADC_SAMPNUM_NONE_gc = (0x00<<0)     ; No accumulation
.equ ADC_SAMPNUM_ACC2_gc = (0x01<<0)     ; 2 samples accumulated
.equ ADC_SAMPNUM_ACC4_gc = (0x02<<0)     ; 4 samples accumulated
.equ ADC_SAMPNUM_ACC8_gc = (0x03<<0)     ; 8 samples accumulated
.equ ADC_SAMPNUM_ACC16_gc = (0x04<<0)    ; 16 samples accumulated
.equ ADC_SAMPNUM_ACC32_gc = (0x05<<0)    ; 32 samples accumulated
.equ ADC_SAMPNUM_ACC64_gc = (0x06<<0)    ; 64 samples accumulated
.equ ADC_SAMPNUM_ACC128_gc = (0x07<<0)   ; 128 samples accumulated
.equ ADC_SAMPNUM_ACC256_gc = (0x08<<0)   ; 256 samples accumulated
.equ ADC_SAMPNUM_ACC512_gc = (0x09<<0)   ; 512 samples accumulated
.equ ADC_SAMPNUM_ACC1024_gc = (0x0A<<0)  ; 1024 samples accumulated

; Analog Channel Selection Bits
.equ ADC_MUXNEG_AIN4_gc = (0x04<<0)      ; ADC input pin 4
.equ ADC_MUXNEG_AIN5_gc = (0x05<<0)      ; ADC input pin 5
.equ ADC_MUXNEG_AIN6_gc = (0x06<<0)      ; ADC input pin 6
.equ ADC_MUXNEG_AIN7_gc = (0x07<<0)      ; ADC input pin 7
.equ ADC_MUXNEG_AIN28_gc = (0x1C<<0)     ; ADC input pin 28
.equ ADC_MUXNEG_AIN29_gc = (0x1D<<0)     ; ADC input pin 29
.equ ADC_MUXNEG_AIN30_gc = (0x1E<<0)     ; ADC input pin 30
.equ ADC_MUXNEG_AIN31_gc = (0x1F<<0)     ; ADC input pin 31
.equ ADC_MUXNEG_GND_gc = (0x30<<0)       ; Ground
.equ ADC_MUXNEG_DAC0_gc = (0x38<<0)      ; Digital to Analog Converter 0
.equ ADC_MUXNEG_DACREF0_gc = (0x39<<0)   ; AC0 DAC reference
.equ ADC_MUXNEG_DACREF1_gc = (0x3A<<0)   ; AC1 DAC reference

; VIA select
.equ ADC_VIA_DIRECT_gc = (0x00<<6)       ; Inputs connected directly to ADC
.equ ADC_VIA_PGA_gc = (0x01<<6)          ; Inputs connected via PGA

; Analog Channel Selection Bits
.equ ADC_MUXPOS_AIN4_gc = (0x04<<0)      ; ADC input pin 4
.equ ADC_MUXPOS_AIN5_gc = (0x05<<0)      ; ADC input pin 5
.equ ADC_MUXPOS_AIN6_gc = (0x06<<0)      ; ADC input pin 6
.equ ADC_MUXPOS_AIN7_gc = (0x07<<0)      ; ADC input pin 7
.equ ADC_MUXPOS_AIN28_gc = (0x1C<<0)     ; ADC input pin 28
.equ ADC_MUXPOS_AIN29_gc = (0x1D<<0)     ; ADC input pin 29
.equ ADC_MUXPOS_AIN30_gc = (0x1E<<0)     ; ADC input pin 30
.equ ADC_MUXPOS_AIN31_gc = (0x1F<<0)     ; ADC input pin 31
.equ ADC_MUXPOS_GND_gc = (0x30<<0)       ; Ground
.equ ADC_MUXPOS_VDD10_gc = (0x31<<0)     ; VDD Divided by 10
.equ ADC_MUXPOS_TEMPSENSE_gc = (0x32<<0) ; Temperature Sensor

; Gain select
.equ ADC_GAIN_1X_gc = (0x00<<5)          ; 1x gain
.equ ADC_GAIN_2X_gc = (0x01<<5)          ; 2x gain
.equ ADC_GAIN_4X_gc = (0x02<<5)          ; 4x gain
.equ ADC_GAIN_8X_gc = (0x03<<5)          ; 8x gain
.equ ADC_GAIN_16X_gc = (0x04<<5)         ; 16x gain

; PGA BIAS Select
.equ ADC_PGABIASSEL_100PCT_gc = (0x00<<3) ; 100% BIAS current.
.equ ADC_PGABIASSEL_75PCT_gc = (0x01<<3) ; 75% BIAS current. Usable for CLK_ADC<4.5MHz
.equ ADC_PGABIASSEL_50PCT_gc = (0x02<<3) ; 50% BIAS current. Usable for CLK_ADC<3MHz
.equ ADC_PGABIASSEL_25PCT_gc = (0x03<<3) ; 25% BIAS current. Usable for CLK_ADC<1.5MHz


;*************************************************************************
;** BOD - Bod interface
;*************************************************************************

; BOD_CTRLA masks
.equ BOD_SLEEP_gm = 0x03                 ; Operation in sleep mode group mask
.equ BOD_SLEEP_gp = 0                    ; Operation in sleep mode group position
.equ BOD_SLEEP_0_bm = (1<<0)             ; Operation in sleep mode bit 0 mask
.equ BOD_SLEEP_0_bp = 0                  ; Operation in sleep mode bit 0 position
.equ BOD_SLEEP_1_bm = (1<<1)             ; Operation in sleep mode bit 1 mask
.equ BOD_SLEEP_1_bp = 1                  ; Operation in sleep mode bit 1 position
.equ BOD_ACTIVE_gm = 0x0C                ; Operation in active mode group mask
.equ BOD_ACTIVE_gp = 2                   ; Operation in active mode group position
.equ BOD_ACTIVE_0_bm = (1<<2)            ; Operation in active mode bit 0 mask
.equ BOD_ACTIVE_0_bp = 2                 ; Operation in active mode bit 0 position
.equ BOD_ACTIVE_1_bm = (1<<3)            ; Operation in active mode bit 1 mask
.equ BOD_ACTIVE_1_bp = 3                 ; Operation in active mode bit 1 position
.equ BOD_SAMPFREQ_bm = 0x10              ; Sample frequency bit mask
.equ BOD_SAMPFREQ_bp = 4                 ; Sample frequency bit position

; BOD_CTRLB masks
.equ BOD_LVL_gm = 0x07                   ; Bod level group mask
.equ BOD_LVL_gp = 0                      ; Bod level group position
.equ BOD_LVL_0_bm = (1<<0)               ; Bod level bit 0 mask
.equ BOD_LVL_0_bp = 0                    ; Bod level bit 0 position
.equ BOD_LVL_1_bm = (1<<1)               ; Bod level bit 1 mask
.equ BOD_LVL_1_bp = 1                    ; Bod level bit 1 position
.equ BOD_LVL_2_bm = (1<<2)               ; Bod level bit 2 mask
.equ BOD_LVL_2_bp = 2                    ; Bod level bit 2 position

; BOD_VLMCTRLA masks
.equ BOD_VLMLVL_gm = 0x03                ; voltage level monitor level group mask
.equ BOD_VLMLVL_gp = 0                   ; voltage level monitor level group position
.equ BOD_VLMLVL_0_bm = (1<<0)            ; voltage level monitor level bit 0 mask
.equ BOD_VLMLVL_0_bp = 0                 ; voltage level monitor level bit 0 position
.equ BOD_VLMLVL_1_bm = (1<<1)            ; voltage level monitor level bit 1 mask
.equ BOD_VLMLVL_1_bp = 1                 ; voltage level monitor level bit 1 position

