QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB14def.inc
; CLKCTRL_MCLKCTRLA masks
.equ CLKCTRL_CLKSEL_gm = 0x07            ; Clock select group mask
.equ CLKCTRL_CLKSEL_gp = 0               ; Clock select group position
.equ CLKCTRL_CLKSEL_0_bm = (1<<0)        ; Clock select bit 0 mask
.equ CLKCTRL_CLKSEL_0_bp = 0             ; Clock select bit 0 position
.equ CLKCTRL_CLKSEL_1_bm = (1<<1)        ; Clock select bit 1 mask
.equ CLKCTRL_CLKSEL_1_bp = 1             ; Clock select bit 1 position
.equ CLKCTRL_CLKSEL_2_bm = (1<<2)        ; Clock select bit 2 mask
.equ CLKCTRL_CLKSEL_2_bp = 2             ; Clock select bit 2 position
.equ CLKCTRL_CLKOUT_bm = 0x80            ; System clock out bit mask
.equ CLKCTRL_CLKOUT_bp = 7               ; System clock out bit position

; CLKCTRL_MCLKCTRLB masks
.equ CLKCTRL_PEN_bm = 0x01               ; Prescaler enable bit mask
.equ CLKCTRL_PEN_bp = 0                  ; Prescaler enable bit position
.equ CLKCTRL_PDIV_gm = 0x1E              ; Prescaler division group mask
.equ CLKCTRL_PDIV_gp = 1                 ; Prescaler division group position
.equ CLKCTRL_PDIV_0_bm = (1<<1)          ; Prescaler division bit 0 mask
.equ CLKCTRL_PDIV_0_bp = 1               ; Prescaler division bit 0 position
.equ CLKCTRL_PDIV_1_bm = (1<<2)          ; Prescaler division bit 1 mask
.equ CLKCTRL_PDIV_1_bp = 2               ; Prescaler division bit 1 position
.equ CLKCTRL_PDIV_2_bm = (1<<3)          ; Prescaler division bit 2 mask
.equ CLKCTRL_PDIV_2_bp = 3               ; Prescaler division bit 2 position
.equ CLKCTRL_PDIV_3_bm = (1<<4)          ; Prescaler division bit 3 mask
.equ CLKCTRL_PDIV_3_bp = 4               ; Prescaler division bit 3 position
.equ CLKCTRL_PDIVB_bm = 0x20             ; Prescaler B division bit mask
.equ CLKCTRL_PDIVB_bp = 5                ; Prescaler B division bit position

; CLKCTRL_MCLKSTATUS masks
.equ CLKCTRL_SOSC_bm = 0x01              ; System Oscillator changing bit mask
.equ CLKCTRL_SOSC_bp = 0                 ; System Oscillator changing bit position
.equ CLKCTRL_OSCHFS_bm = 0x02            ; High frequency oscillator status bit mask
.equ CLKCTRL_OSCHFS_bp = 1               ; High frequency oscillator status bit position
.equ CLKCTRL_OSC32KS_bm = 0x04           ; 32KHz oscillator status bit mask
.equ CLKCTRL_OSC32KS_bp = 2              ; 32KHz oscillator status bit position
.equ CLKCTRL_XOSC32KS_bm = 0x08          ; 32.768 kHz Crystal Oscillator status bit mask
.equ CLKCTRL_XOSC32KS_bp = 3             ; 32.768 kHz Crystal Oscillator status bit position
.equ CLKCTRL_EXTS_bm = 0x10              ; External Clock status bit mask
.equ CLKCTRL_EXTS_bp = 4                 ; External Clock status bit position
.equ CLKCTRL_PLLS_bm = 0x20              ; PLL status bit mask
.equ CLKCTRL_PLLS_bp = 5                 ; PLL status bit position

; CLKCTRL_MCLKTIMEBASE masks
.equ CLKCTRL_TIMEBASE_gm = 0x1F          ; Timebase group mask
.equ CLKCTRL_TIMEBASE_gp = 0             ; Timebase group position
.equ CLKCTRL_TIMEBASE_0_bm = (1<<0)      ; Timebase bit 0 mask
.equ CLKCTRL_TIMEBASE_0_bp = 0           ; Timebase bit 0 position
.equ CLKCTRL_TIMEBASE_1_bm = (1<<1)      ; Timebase bit 1 mask
.equ CLKCTRL_TIMEBASE_1_bp = 1           ; Timebase bit 1 position
.equ CLKCTRL_TIMEBASE_2_bm = (1<<2)      ; Timebase bit 2 mask
.equ CLKCTRL_TIMEBASE_2_bp = 2           ; Timebase bit 2 position
.equ CLKCTRL_TIMEBASE_3_bm = (1<<3)      ; Timebase bit 3 mask
.equ CLKCTRL_TIMEBASE_3_bp = 3           ; Timebase bit 3 position
.equ CLKCTRL_TIMEBASE_4_bm = (1<<4)      ; Timebase bit 4 mask
.equ CLKCTRL_TIMEBASE_4_bp = 4           ; Timebase bit 4 position

; CLKCTRL_OSCHFCTRLA masks
.equ CLKCTRL_AUTOTUNE_gm = 0x03          ; Automatic Oscillator Tune group mask
.equ CLKCTRL_AUTOTUNE_gp = 0             ; Automatic Oscillator Tune group position
.equ CLKCTRL_AUTOTUNE_0_bm = (1<<0)      ; Automatic Oscillator Tune bit 0 mask
.equ CLKCTRL_AUTOTUNE_0_bp = 0           ; Automatic Oscillator Tune bit 0 position
.equ CLKCTRL_AUTOTUNE_1_bm = (1<<1)      ; Automatic Oscillator Tune bit 1 mask
.equ CLKCTRL_AUTOTUNE_1_bp = 1           ; Automatic Oscillator Tune bit 1 position
.equ CLKCTRL_RUNSTDBY_bm = 0x80          ; Run in standby bit mask
.equ CLKCTRL_RUNSTDBY_bp = 7             ; Run in standby bit position

; CLKCTRL_OSCHFTUNE masks
.equ CLKCTRL_TUNE_gm = 0xFF              ; Oscillator Tune group mask
.equ CLKCTRL_TUNE_gp = 0                 ; Oscillator Tune group position
.equ CLKCTRL_TUNE_0_bm = (1<<0)          ; Oscillator Tune bit 0 mask
.equ CLKCTRL_TUNE_0_bp = 0               ; Oscillator Tune bit 0 position
.equ CLKCTRL_TUNE_1_bm = (1<<1)          ; Oscillator Tune bit 1 mask
.equ CLKCTRL_TUNE_1_bp = 1               ; Oscillator Tune bit 1 position
.equ CLKCTRL_TUNE_2_bm = (1<<2)          ; Oscillator Tune bit 2 mask
.equ CLKCTRL_TUNE_2_bp = 2               ; Oscillator Tune bit 2 position
.equ CLKCTRL_TUNE_3_bm = (1<<3)          ; Oscillator Tune bit 3 mask
.equ CLKCTRL_TUNE_3_bp = 3               ; Oscillator Tune bit 3 position
.equ CLKCTRL_TUNE_4_bm = (1<<4)          ; Oscillator Tune bit 4 mask
.equ CLKCTRL_TUNE_4_bp = 4               ; Oscillator Tune bit 4 position
.equ CLKCTRL_TUNE_5_bm = (1<<5)          ; Oscillator Tune bit 5 mask
.equ CLKCTRL_TUNE_5_bp = 5               ; Oscillator Tune bit 5 position
.equ CLKCTRL_TUNE_6_bm = (1<<6)          ; Oscillator Tune bit 6 mask
.equ CLKCTRL_TUNE_6_bp = 6               ; Oscillator Tune bit 6 position
.equ CLKCTRL_TUNE_7_bm = (1<<7)          ; Oscillator Tune bit 7 mask
.equ CLKCTRL_TUNE_7_bp = 7               ; Oscillator Tune bit 7 position

; CLKCTRL_PLLCTRLA masks
.equ CLKCTRL_MULFAC_gm = 0x03            ; PLL Multiplication Factor group mask
.equ CLKCTRL_MULFAC_gp = 0               ; PLL Multiplication Factor group position
.equ CLKCTRL_MULFAC_0_bm = (1<<0)        ; PLL Multiplication Factor bit 0 mask
.equ CLKCTRL_MULFAC_0_bp = 0             ; PLL Multiplication Factor bit 0 position
.equ CLKCTRL_MULFAC_1_bm = (1<<1)        ; PLL Multiplication Factor bit 1 mask
.equ CLKCTRL_MULFAC_1_bp = 1             ; PLL Multiplication Factor bit 1 position
.equ CLKCTRL_SOURCEDIV_gm = 0x18         ; PLL Source Division group mask
.equ CLKCTRL_SOURCEDIV_gp = 3            ; PLL Source Division group position
.equ CLKCTRL_SOURCEDIV_0_bm = (1<<3)     ; PLL Source Division bit 0 mask
.equ CLKCTRL_SOURCEDIV_0_bp = 3          ; PLL Source Division bit 0 position
.equ CLKCTRL_SOURCEDIV_1_bm = (1<<4)     ; PLL Source Division bit 1 mask
.equ CLKCTRL_SOURCEDIV_1_bp = 4          ; PLL Source Division bit 1 position
.equ CLKCTRL_SOURCE_gm = 0x60            ; PLL Source group mask
.equ CLKCTRL_SOURCE_gp = 5               ; PLL Source group position
.equ CLKCTRL_SOURCE_0_bm = (1<<5)        ; PLL Source bit 0 mask
.equ CLKCTRL_SOURCE_0_bp = 5             ; PLL Source bit 0 position
.equ CLKCTRL_SOURCE_1_bm = (1<<6)        ; PLL Source bit 1 mask
.equ CLKCTRL_SOURCE_1_bp = 6             ; PLL Source bit 1 position
; Masks for CLKCTRL_RUNSTDBY already defined

; CLKCTRL_PLLCTRLB masks
.equ CLKCTRL_CLKDIV_bm = 0x01            ; PLL Output Clock Division bit mask
.equ CLKCTRL_CLKDIV_bp = 0               ; PLL Output Clock Division bit position

; CLKCTRL_OSC32KCTRLA masks
; Masks for CLKCTRL_RUNSTDBY already defined

; CLKCTRL_XOSC32KCTRLA masks
.equ CLKCTRL_ENABLE_bm = 0x01            ; Enable bit mask
.equ CLKCTRL_ENABLE_bp = 0               ; Enable bit position
.equ CLKCTRL_LPMODE_bm = 0x02            ; Low power mode bit mask
.equ CLKCTRL_LPMODE_bp = 1               ; Low power mode bit position
.equ CLKCTRL_SEL_bm = 0x04               ; Select bit mask
.equ CLKCTRL_SEL_bp = 2                  ; Select bit position
.equ CLKCTRL_CSUT_gm = 0x30              ; Crystal startup time group mask
.equ CLKCTRL_CSUT_gp = 4                 ; Crystal startup time group position
.equ CLKCTRL_CSUT_0_bm = (1<<4)          ; Crystal startup time bit 0 mask
.equ CLKCTRL_CSUT_0_bp = 4               ; Crystal startup time bit 0 position
.equ CLKCTRL_CSUT_1_bm = (1<<5)          ; Crystal startup time bit 1 mask
.equ CLKCTRL_CSUT_1_bp = 5               ; Crystal startup time bit 1 position
; Masks for CLKCTRL_RUNSTDBY already defined

; Clock select
.equ CLKCTRL_CLKSEL_OSCHF_gc = (0x00<<0) ; Internal high-frequency oscillator
.equ CLKCTRL_CLKSEL_OSC32K_gc = (0x01<<0) ; Internal 32.768 kHz oscillator
.equ CLKCTRL_CLKSEL_XOSC32K_gc = (0x02<<0) ; 32.768 kHz crystal oscillator
.equ CLKCTRL_CLKSEL_EXTCLK_gc = (0x03<<0) ; External clock
.equ CLKCTRL_CLKSEL_PLL_gc = (0x04<<0)   ; PLL Oscillator

; Prescaler division select
.equ CLKCTRL_PDIV_DIV2_gc = (0x00<<1)    ; Divide by 2
.equ CLKCTRL_PDIV_DIV4_gc = (0x01<<1)    ; Divide by 4
.equ CLKCTRL_PDIV_DIV8_gc = (0x02<<1)    ; Divide by 8
.equ CLKCTRL_PDIV_DIV16_gc = (0x03<<1)   ; Divide by 16
.equ CLKCTRL_PDIV_DIV32_gc = (0x04<<1)   ; Divide by 32
.equ CLKCTRL_PDIV_DIV64_gc = (0x05<<1)   ; Divide by 64
.equ CLKCTRL_PDIV_DIV6_gc = (0x08<<1)    ; Divide by 6
.equ CLKCTRL_PDIV_DIV10_gc = (0x09<<1)   ; Divide by 10
.equ CLKCTRL_PDIV_DIV12_gc = (0x0A<<1)   ; Divide by 12
.equ CLKCTRL_PDIV_DIV24_gc = (0x0B<<1)   ; Divide by 24
.equ CLKCTRL_PDIV_DIV48_gc = (0x0C<<1)   ; Divide by 48

; Prescaler B division select
.equ CLKCTRL_PDIVB_NONE_gc = (0x00<<5)   ; No division
.equ CLKCTRL_PDIVB_DIV4_gc = (0x01<<5)   ; Divide by 4

; Automatic Oscillator Tune select
.equ CLKCTRL_AUTOTUNE_OFF_gc = (0x00<<0) ; Disabled
.equ CLKCTRL_AUTOTUNE_XOSC32K_gc = (0x01<<0) ; Tune against 32.768 kHz Crystal Oscillator

; PLL Multiplication Factor select
.equ CLKCTRL_MULFAC_OFF_gc = (0x00<<0)   ; PLL Disabled
.equ CLKCTRL_MULFAC_8X_gc = (0x02<<0)    ; Multiply by 8
.equ CLKCTRL_MULFAC_16X_gc = (0x03<<0)   ; Multiply by 16

