QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB14def.inc
; Event Generator 1 Select
.equ PORT_EVGEN1SEL_PIN0_gc = (0x00<<4)  ; Pin 0 used as event generator
.equ PORT_EVGEN1SEL_PIN1_gc = (0x01<<4)  ; Pin 1 used as event generator
.equ PORT_EVGEN1SEL_PIN2_gc = (0x02<<4)  ; Pin 2 used as event generator
.equ PORT_EVGEN1SEL_PIN3_gc = (0x03<<4)  ; Pin 3 used as event generator
.equ PORT_EVGEN1SEL_PIN4_gc = (0x04<<4)  ; Pin 4 used as event generator
.equ PORT_EVGEN1SEL_PIN5_gc = (0x05<<4)  ; Pin 5 used as event generator
.equ PORT_EVGEN1SEL_PIN6_gc = (0x06<<4)  ; Pin 6 used as event generator
.equ PORT_EVGEN1SEL_PIN7_gc = (0x07<<4)  ; Pin 7 used as event generator

; Input Level Select
.equ PORT_INLVL_ST_gc = (0x00<<6)        ; Schmitt-Trigger input level
.equ PORT_INLVL_TTL_gc = (0x01<<6)       ; TTL Input level

; Input/Sense Configuration select
.equ PORT_ISC_INTDISABLE_gc = (0x00<<0)  ; Interrupt disabled but input buffer enabled
.equ PORT_ISC_BOTHEDGES_gc = (0x01<<0)   ; Sense Both Edges
.equ PORT_ISC_RISING_gc = (0x02<<0)      ; Sense Rising Edge
.equ PORT_ISC_FALLING_gc = (0x03<<0)     ; Sense Falling Edge
.equ PORT_ISC_INPUT_DISABLE_gc = (0x04<<0) ; Digital Input Buffer disabled
.equ PORT_ISC_LEVEL_gc = (0x05<<0)       ; Sense low Level


;*************************************************************************
;** PORTMUX - Port Multiplexer
;*************************************************************************

; PORTMUX_EVSYSROUTEA masks
.equ PORTMUX_EVOUTC_bm = 0x04            ; Event Output C bit mask
.equ PORTMUX_EVOUTC_bp = 2               ; Event Output C bit position
.equ PORTMUX_EVOUTD_bm = 0x08            ; Event Output D bit mask
.equ PORTMUX_EVOUTD_bp = 3               ; Event Output D bit position
.equ PORTMUX_EVOUTF_bm = 0x20            ; Event Output F bit mask
.equ PORTMUX_EVOUTF_bp = 5               ; Event Output F bit position

; PORTMUX_CCLROUTEA masks
.equ PORTMUX_LUT0_bm = 0x01              ; CCL Look-Up Table 0 Signals bit mask
.equ PORTMUX_LUT0_bp = 0                 ; CCL Look-Up Table 0 Signals bit position
.equ PORTMUX_LUT1_bm = 0x02              ; CCL Look-Up Table 1 Signals bit mask
.equ PORTMUX_LUT1_bp = 1                 ; CCL Look-Up Table 1 Signals bit position
.equ PORTMUX_LUT2_bm = 0x04              ; CCL Look-Up Table 2 Signals bit mask
.equ PORTMUX_LUT2_bp = 2                 ; CCL Look-Up Table 2 Signals bit position

; PORTMUX_USARTROUTEA masks
.equ PORTMUX_USART0_gm = 0x07            ; USART0 Routing group mask
.equ PORTMUX_USART0_gp = 0               ; USART0 Routing group position
.equ PORTMUX_USART0_0_bm = (1<<0)        ; USART0 Routing bit 0 mask
.equ PORTMUX_USART0_0_bp = 0             ; USART0 Routing bit 0 position
.equ PORTMUX_USART0_1_bm = (1<<1)        ; USART0 Routing bit 1 mask
.equ PORTMUX_USART0_1_bp = 1             ; USART0 Routing bit 1 position
.equ PORTMUX_USART0_2_bm = (1<<2)        ; USART0 Routing bit 2 mask
.equ PORTMUX_USART0_2_bp = 2             ; USART0 Routing bit 2 position

; PORTMUX_SPIROUTEA masks
.equ PORTMUX_SPI0_gm = 0x07              ; SPI0 Signals group mask
.equ PORTMUX_SPI0_gp = 0                 ; SPI0 Signals group position
.equ PORTMUX_SPI0_0_bm = (1<<0)          ; SPI0 Signals bit 0 mask
.equ PORTMUX_SPI0_0_bp = 0               ; SPI0 Signals bit 0 position
.equ PORTMUX_SPI0_1_bm = (1<<1)          ; SPI0 Signals bit 1 mask
.equ PORTMUX_SPI0_1_bp = 1               ; SPI0 Signals bit 1 position
.equ PORTMUX_SPI0_2_bm = (1<<2)          ; SPI0 Signals bit 2 mask
.equ PORTMUX_SPI0_2_bp = 2               ; SPI0 Signals bit 2 position

; PORTMUX_TWIROUTEA masks
.equ PORTMUX_TWI0_gm = 0x03              ; TWI0 Signals group mask
.equ PORTMUX_TWI0_gp = 0                 ; TWI0 Signals group position
.equ PORTMUX_TWI0_0_bm = (1<<0)          ; TWI0 Signals bit 0 mask
.equ PORTMUX_TWI0_0_bp = 0               ; TWI0 Signals bit 0 position
.equ PORTMUX_TWI0_1_bm = (1<<1)          ; TWI0 Signals bit 1 mask
.equ PORTMUX_TWI0_1_bp = 1               ; TWI0 Signals bit 1 position

; PORTMUX_TCEROUTEA masks
.equ PORTMUX_TCE0_gm = 0x0F              ; TCE0 Signals group mask
.equ PORTMUX_TCE0_gp = 0                 ; TCE0 Signals group position
.equ PORTMUX_TCE0_0_bm = (1<<0)          ; TCE0 Signals bit 0 mask
.equ PORTMUX_TCE0_0_bp = 0               ; TCE0 Signals bit 0 position
.equ PORTMUX_TCE0_1_bm = (1<<1)          ; TCE0 Signals bit 1 mask
.equ PORTMUX_TCE0_1_bp = 1               ; TCE0 Signals bit 1 position
.equ PORTMUX_TCE0_2_bm = (1<<2)          ; TCE0 Signals bit 2 mask
.equ PORTMUX_TCE0_2_bp = 2               ; TCE0 Signals bit 2 position
.equ PORTMUX_TCE0_3_bm = (1<<3)          ; TCE0 Signals bit 3 mask
.equ PORTMUX_TCE0_3_bp = 3               ; TCE0 Signals bit 3 position

; PORTMUX_TCFROUTEA masks
.equ PORTMUX_TCF0_gm = 0x03              ; TCF0 Output group mask
.equ PORTMUX_TCF0_gp = 0                 ; TCF0 Output group position
.equ PORTMUX_TCF0_0_bm = (1<<0)          ; TCF0 Output bit 0 mask
.equ PORTMUX_TCF0_0_bp = 0               ; TCF0 Output bit 0 position
.equ PORTMUX_TCF0_1_bm = (1<<1)          ; TCF0 Output bit 1 mask
.equ PORTMUX_TCF0_1_bp = 1               ; TCF0 Output bit 1 position

; CCL Look-Up Table 0 Signals select
.equ PORTMUX_LUT0_DEFAULT_gc = (0x00<<0) ; Out: PA3 In: PA0, PA1, PA2

; CCL Look-Up Table 1 Signals select
.equ PORTMUX_LUT1_DEFAULT_gc = (0x00<<1) ; Out: PC3 In: PC0, PC1, PC2

; CCL Look-Up Table 2 Signals select
.equ PORTMUX_LUT2_ALT1_gc = (0x01<<2)    ; Out: PD6 In: PD0, PD1, PD2

; Event Output C select
.equ PORTMUX_EVOUTC_DEFAULT_gc = (0x00<<2) ; EVOUT on PC2

; Event Output D select
.equ PORTMUX_EVOUTD_ALT1_gc = (0x01<<3)  ; EVOUT on PD7

; Event Output F select
.equ PORTMUX_EVOUTF_ALT1_gc = (0x01<<5)  ; EVOUT on PF7

; SPI0 Signals select
.equ PORTMUX_SPI0_ALT3_gc = (0x03<<0)    ; PA0, PA1, PC0, PC1
.equ PORTMUX_SPI0_ALT4_gc = (0x04<<0)    ; PD4, PD5, PD6, PD7
.equ PORTMUX_SPI0_ALT5_gc = (0x05<<0)    ; PC0, PC1, PC2, PC3
.equ PORTMUX_SPI0_ALT6_gc = (0x06<<0)    ; PC1, PC2, PC3, -
.equ PORTMUX_SPI0_NONE_gc = (0x07<<0)    ; Not connected to any pins, SS set to 1

; TCE0 Signals select
.equ PORTMUX_TCE0_PORTA_gc = (0x00<<0)   ; PA0, PA1, PA2, PA3, PA4, PA5, PA6, PA7
.equ PORTMUX_TCE0_PORTC_gc = (0x02<<0)   ; PC0, PC1, PC2, PC3, -, -, -, -
.equ PORTMUX_TCE0_PORTC2_gc = (0x08<<0)  ; PA0, PA1, PC0, PC1, PC2, PC3, -, -

; TCF0 Output select
.equ PORTMUX_TCF0_DEFAULT_gc = (0x00<<0) ; PA0, PA1

; TWI0 Signals select
.equ PORTMUX_TWI0_DEFAULT_gc = (0x00<<0) ; {PA2, PA3}, {PC2, PC3}
.equ PORTMUX_TWI0_ALT2_gc = (0x02<<0)    ; {PC2, PC3}, {-, -}
.equ PORTMUX_TWI0_ALT3_gc = (0x03<<0)    ; {PA0, PA1}, {PC2, PC3}

; USART0 Routing select
.equ PORTMUX_USART0_DEFAULT_gc = (0x00<<0) ; {PA0, PA1, PA2, PA3}
.equ PORTMUX_USART0_ALT3_gc = (0x03<<0)  ; {PD4, PD5, PD6, PD7}
.equ PORTMUX_USART0_ALT4_gc = (0x04<<0)  ; {PC1, PC2, PC3, -}
.equ PORTMUX_USART0_ALT6_gc = (0x06<<0)  ; {PF7, PF6, -, -}
.equ PORTMUX_USART0_NONE_gc = (0x07<<0)  ; Not connected to any pins


;*************************************************************************
;** RSTCTRL - Reset controller
;*************************************************************************

; RSTCTRL_RSTFR masks
.equ RSTCTRL_PORF_bm = 0x01              ; Power on Reset flag bit mask
.equ RSTCTRL_PORF_bp = 0                 ; Power on Reset flag bit position
.equ RSTCTRL_BORF_bm = 0x02              ; Brown out detector Reset flag bit mask
.equ RSTCTRL_BORF_bp = 1                 ; Brown out detector Reset flag bit position
.equ RSTCTRL_EXTRF_bm = 0x04             ; External Reset flag bit mask
.equ RSTCTRL_EXTRF_bp = 2                ; External Reset flag bit position
.equ RSTCTRL_WDRF_bm = 0x08              ; Watch dog Reset flag bit mask
.equ RSTCTRL_WDRF_bp = 3                 ; Watch dog Reset flag bit position
.equ RSTCTRL_SWRF_bm = 0x10              ; Software Reset flag bit mask
.equ RSTCTRL_SWRF_bp = 4                 ; Software Reset flag bit position
.equ RSTCTRL_UPDIRF_bm = 0x20            ; UPDI Reset flag bit mask
.equ RSTCTRL_UPDIRF_bp = 5               ; UPDI Reset flag bit position

; RSTCTRL_SWRR masks
.equ RSTCTRL_SWRE_bm = 0x01              ; Software Reset Enable bit mask
.equ RSTCTRL_SWRE_bp = 0                 ; Software Reset Enable bit position


;*************************************************************************
;** RTC - Real-Time Counter
;*************************************************************************

