QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB14def.inc
; Clock Select
.equ TCB_CLKSEL_DIV1_gc = (0x00<<1)      ; CLK_PER
.equ TCB_CLKSEL_DIV2_gc = (0x01<<1)      ; CLK_PER/2
.equ TCB_CLKSEL_TCE0_gc = (0x02<<1)      ; Use CLK_TCE from TCE0
.equ TCB_CLKSEL_EVENT_gc = (0x07<<1)     ; Count on event edge

; Timer Mode select
.equ TCB_CNTMODE_INT_gc = (0x00<<0)      ; Periodic Interrupt
.equ TCB_CNTMODE_TIMEOUT_gc = (0x01<<0)  ; Periodic Timeout
.equ TCB_CNTMODE_CAPT_gc = (0x02<<0)     ; Input Capture Event
.equ TCB_CNTMODE_FRQ_gc = (0x03<<0)      ; Input Capture Frequency measurement
.equ TCB_CNTMODE_PW_gc = (0x04<<0)       ; Input Capture Pulse-Width measurement
.equ TCB_CNTMODE_FRQPW_gc = (0x05<<0)    ; Input Capture Frequency and Pulse-Width measurement
.equ TCB_CNTMODE_SINGLE_gc = (0x06<<0)   ; Single Shot
.equ TCB_CNTMODE_PWM8_gc = (0x07<<0)     ; 8-bit PWM

; Event Generation select
.equ TCB_EVGEN_PULSE_gc = (0x00<<7)      ; Event is generated as pulse at compare match or capture
.equ TCB_EVGEN_WAVEFORM_gc = (0x01<<7)   ; Event is generated as waveform for modes with waveform

; Counter Size select
.equ TCB_CNTSIZE_16BITS_gc = (0x00<<0)   ; 16-bit CNT. MAX=16'hFFFF
.equ TCB_CNTSIZE_15BITS_gc = (0x01<<0)   ; 15-bit CNT. MAX=16'h7FFF
.equ TCB_CNTSIZE_14BITS_gc = (0x02<<0)   ; 14-bit CNT. MAX=16'h3FFF
.equ TCB_CNTSIZE_13BITS_gc = (0x03<<0)   ; 13-bit CNT. MAX=16'h1FFF
.equ TCB_CNTSIZE_12BITS_gc = (0x04<<0)   ; 12-bit CNT. MAX=16'h0FFF
.equ TCB_CNTSIZE_11BITS_gc = (0x05<<0)   ; 11-bit CNT. MAX=16'h07FF
.equ TCB_CNTSIZE_10BITS_gc = (0x06<<0)   ; 10-bit CNT. MAX=16'h03FF
.equ TCB_CNTSIZE_9BITS_gc = (0x07<<0)    ; 9-bit CNT. MAX=16'h01FF


;*************************************************************************
;** TCE - 16-bit Timer/Counter Type E
;*************************************************************************

; TCE_CTRLA masks
.equ TCE_ENABLE_bm = 0x01                ; Module Enable bit mask
.equ TCE_ENABLE_bp = 0                   ; Module Enable bit position
.equ TCE_CLKSEL_gm = 0x0E                ; Clock Selection group mask
.equ TCE_CLKSEL_gp = 1                   ; Clock Selection group position
.equ TCE_CLKSEL_0_bm = (1<<1)            ; Clock Selection bit 0 mask
.equ TCE_CLKSEL_0_bp = 1                 ; Clock Selection bit 0 position
.equ TCE_CLKSEL_1_bm = (1<<2)            ; Clock Selection bit 1 mask
.equ TCE_CLKSEL_1_bp = 2                 ; Clock Selection bit 1 position
.equ TCE_CLKSEL_2_bm = (1<<3)            ; Clock Selection bit 2 mask
.equ TCE_CLKSEL_2_bp = 3                 ; Clock Selection bit 2 position
.equ TCE_RUNSTDBY_bm = 0x80              ; Run in Standby bit mask
.equ TCE_RUNSTDBY_bp = 7                 ; Run in Standby bit position

; TCE_CTRLB masks
.equ TCE_WGMODE_gm = 0x07                ; Waveform generation mode group mask
.equ TCE_WGMODE_gp = 0                   ; Waveform generation mode group position
.equ TCE_WGMODE_0_bm = (1<<0)            ; Waveform generation mode bit 0 mask
.equ TCE_WGMODE_0_bp = 0                 ; Waveform generation mode bit 0 position
.equ TCE_WGMODE_1_bm = (1<<1)            ; Waveform generation mode bit 1 mask
.equ TCE_WGMODE_1_bp = 1                 ; Waveform generation mode bit 1 position
.equ TCE_WGMODE_2_bm = (1<<2)            ; Waveform generation mode bit 2 mask
.equ TCE_WGMODE_2_bp = 2                 ; Waveform generation mode bit 2 position
.equ TCE_ALUPD_bm = 0x08                 ; Auto Lock Update bit mask
.equ TCE_ALUPD_bp = 3                    ; Auto Lock Update bit position
.equ TCE_CMP0EN_bm = 0x10                ; Compare 0 Enable bit mask
.equ TCE_CMP0EN_bp = 4                   ; Compare 0 Enable bit position
.equ TCE_CMP1EN_bm = 0x20                ; Compare 1 Enable bit mask
.equ TCE_CMP1EN_bp = 5                   ; Compare 1 Enable bit position
.equ TCE_CMP2EN_bm = 0x40                ; Compare 2 Enable bit mask
.equ TCE_CMP2EN_bp = 6                   ; Compare 2 Enable bit position
.equ TCE_CMP3EN_bm = 0x80                ; Compare 3 Enable bit mask
.equ TCE_CMP3EN_bp = 7                   ; Compare 3 Enable bit position

; TCE_CTRLC masks
.equ TCE_CMP0OV_bm = 0x01                ; Compare 0 Waveform Output Value bit mask
.equ TCE_CMP0OV_bp = 0                   ; Compare 0 Waveform Output Value bit position
.equ TCE_CMP1OV_bm = 0x02                ; Compare 1 Waveform Output Value bit mask
.equ TCE_CMP1OV_bp = 1                   ; Compare 1 Waveform Output Value bit position
.equ TCE_CMP2OV_bm = 0x04                ; Compare 2 Waveform Output Value bit mask
.equ TCE_CMP2OV_bp = 2                   ; Compare 2 Waveform Output Value bit position
.equ TCE_CMP3OV_bm = 0x08                ; Compare 3 Waveform Output Value bit mask
.equ TCE_CMP3OV_bp = 3                   ; Compare 3 Waveform Output Value bit position
.equ TCE_CMP0POL_bm = 0x10               ; Compare 0 Polarity bit mask
.equ TCE_CMP0POL_bp = 4                  ; Compare 0 Polarity bit position
.equ TCE_CMP1POL_bm = 0x20               ; Compare 1 Polarity bit mask
.equ TCE_CMP1POL_bp = 5                  ; Compare 1 Polarity bit position
.equ TCE_CMP2POL_bm = 0x40               ; Compare 2 Polarity bit mask
.equ TCE_CMP2POL_bp = 6                  ; Compare 2 Polarity bit position
.equ TCE_CMP3POL_bm = 0x80               ; Compare 3 Polarity bit mask
.equ TCE_CMP3POL_bp = 7                  ; Compare 3 Polarity bit position

; TCE_CTRLD masks
.equ TCE_SCALE_bm = 0x04                 ; Scaled Write bit mask
.equ TCE_SCALE_bp = 2                    ; Scaled Write bit position
.equ TCE_AMPEN_bm = 0x08                 ; Amplitude Control Enable bit mask
.equ TCE_AMPEN_bp = 3                    ; Amplitude Control Enable bit position
.equ TCE_SCALEMODE_gm = 0x30             ; Scaling Mode group mask
.equ TCE_SCALEMODE_gp = 4                ; Scaling Mode group position
.equ TCE_SCALEMODE_0_bm = (1<<4)         ; Scaling Mode bit 0 mask
.equ TCE_SCALEMODE_0_bp = 4              ; Scaling Mode bit 0 position
.equ TCE_SCALEMODE_1_bm = (1<<5)         ; Scaling Mode bit 1 mask
.equ TCE_SCALEMODE_1_bp = 5              ; Scaling Mode bit 1 position
.equ TCE_HREN_gm = 0xC0                  ; High Resolution Enable group mask
.equ TCE_HREN_gp = 6                     ; High Resolution Enable group position
.equ TCE_HREN_0_bm = (1<<6)              ; High Resolution Enable bit 0 mask
.equ TCE_HREN_0_bp = 6                   ; High Resolution Enable bit 0 position
.equ TCE_HREN_1_bm = (1<<7)              ; High Resolution Enable bit 1 mask
.equ TCE_HREN_1_bp = 7                   ; High Resolution Enable bit 1 position

; TCE_CTRLECLR masks
.equ TCE_DIR_bm = 0x01                   ; Direction bit mask
.equ TCE_DIR_bp = 0                      ; Direction bit position
.equ TCE_LUPD_bm = 0x02                  ; Lock Update bit mask
.equ TCE_LUPD_bp = 1                     ; Lock Update bit position
.equ TCE_CMD_gm = 0x0C                   ; Command group mask
.equ TCE_CMD_gp = 2                      ; Command group position
.equ TCE_CMD_0_bm = (1<<2)               ; Command bit 0 mask
.equ TCE_CMD_0_bp = 2                    ; Command bit 0 position
.equ TCE_CMD_1_bm = (1<<3)               ; Command bit 1 mask
.equ TCE_CMD_1_bp = 3                    ; Command bit 1 position

; TCE_CTRLESET masks
; Masks for TCE_DIR already defined
; Masks for TCE_LUPD already defined
; Masks for TCE_CMD already defined

; TCE_CTRLFCLR masks
.equ TCE_PERBV_bm = 0x01                 ; Period Buffer Valid bit mask
.equ TCE_PERBV_bp = 0                    ; Period Buffer Valid bit position
.equ TCE_CMP0BV_bm = 0x02                ; Compare 0 Buffer Valid bit mask
.equ TCE_CMP0BV_bp = 1                   ; Compare 0 Buffer Valid bit position
.equ TCE_CMP1BV_bm = 0x04                ; Compare 1 Buffer Valid bit mask
.equ TCE_CMP1BV_bp = 2                   ; Compare 1 Buffer Valid bit position
.equ TCE_CMP2BV_bm = 0x08                ; Compare 2 Buffer Valid bit mask
.equ TCE_CMP2BV_bp = 3                   ; Compare 2 Buffer Valid bit position
.equ TCE_CMP3BV_bm = 0x10                ; Compare 3 Buffer Valid bit mask
.equ TCE_CMP3BV_bp = 4                   ; Compare 3 Buffer Valid bit position

; TCE_CTRLFSET masks
; Masks for TCE_PERBV already defined
; Masks for TCE_CMP0BV already defined
; Masks for TCE_CMP1BV already defined
; Masks for TCE_CMP2BV already defined
; Masks for TCE_CMP3BV already defined

; TCE_EVGENCTRL masks
.equ TCE_CMP0EV_bm = 0x10                ; Compare 0 Event bit mask
.equ TCE_CMP0EV_bp = 4                   ; Compare 0 Event bit position
.equ TCE_CMP1EV_bm = 0x20                ; Compare 1 Event bit mask
.equ TCE_CMP1EV_bp = 5                   ; Compare 1 Event bit position
.equ TCE_CMP2EV_bm = 0x40                ; Compare 2 Event bit mask
.equ TCE_CMP2EV_bp = 6                   ; Compare 2 Event bit position
.equ TCE_CMP3EV_bm = 0x80                ; Compare 3 Event bit mask
.equ TCE_CMP3EV_bp = 7                   ; Compare 3 Event bit position

; TCE_EVCTRL masks
.equ TCE_CNTAEI_bm = 0x01                ; Count on Event Input A bit mask
.equ TCE_CNTAEI_bp = 0                   ; Count on Event Input A bit position
.equ TCE_EVACTA_gm = 0x0E                ; Event Action A group mask
.equ TCE_EVACTA_gp = 1                   ; Event Action A group position
.equ TCE_EVACTA_0_bm = (1<<1)            ; Event Action A bit 0 mask
.equ TCE_EVACTA_0_bp = 1                 ; Event Action A bit 0 position
.equ TCE_EVACTA_1_bm = (1<<2)            ; Event Action A bit 1 mask
.equ TCE_EVACTA_1_bp = 2                 ; Event Action A bit 1 position
.equ TCE_EVACTA_2_bm = (1<<3)            ; Event Action A bit 2 mask
.equ TCE_EVACTA_2_bp = 3                 ; Event Action A bit 2 position
.equ TCE_CNTBEI_bm = 0x10                ; Count on Event Input B bit mask
.equ TCE_CNTBEI_bp = 4                   ; Count on Event Input B bit position
.equ TCE_EVACTB_gm = 0xE0                ; Event Action B group mask
.equ TCE_EVACTB_gp = 5                   ; Event Action B group position
.equ TCE_EVACTB_0_bm = (1<<5)            ; Event Action B bit 0 mask
.equ TCE_EVACTB_0_bp = 5                 ; Event Action B bit 0 position
.equ TCE_EVACTB_1_bm = (1<<6)            ; Event Action B bit 1 mask
.equ TCE_EVACTB_1_bp = 6                 ; Event Action B bit 1 position
.equ TCE_EVACTB_2_bm = (1<<7)            ; Event Action B bit 2 mask
.equ TCE_EVACTB_2_bp = 7                 ; Event Action B bit 2 position

; TCE_INTCTRL masks
.equ TCE_OVF_bm = 0x01                   ; Overflow Interrupt Enable bit mask
.equ TCE_OVF_bp = 0                      ; Overflow Interrupt Enable bit position
.equ TCE_CMP0_bm = 0x10                  ; Compare 0 Interrupt Enable bit mask
.equ TCE_CMP0_bp = 4                     ; Compare 0 Interrupt Enable bit position
.equ TCE_CMP1_bm = 0x20                  ; Compare 1 Interrupt Enable bit mask
.equ TCE_CMP1_bp = 5                     ; Compare 1 Interrupt Enable bit position
.equ TCE_CMP2_bm = 0x40                  ; Compare 2 Interrupt Enable bit mask
.equ TCE_CMP2_bp = 6                     ; Compare 2 Interrupt Enable bit position
.equ TCE_CMP3_bm = 0x80                  ; Compare 3 Interrupt Enable bit mask
.equ TCE_CMP3_bp = 7                     ; Compare 3 Interrupt Enable bit position

