QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB14def.inc
; WEX_STATUS masks
.equ WEX_FDSTATE_bm = 0x01               ; Fault Detection State bit mask
.equ WEX_FDSTATE_bp = 0                  ; Fault Detection State bit position
.equ WEX_FDSEVA_bm = 0x04                ; Fault Detection State Event A bit mask
.equ WEX_FDSEVA_bp = 2                   ; Fault Detection State Event A bit position
.equ WEX_FDSEVB_bm = 0x08                ; Fault Detection State Event B bit mask
.equ WEX_FDSEVB_bp = 3                   ; Fault Detection State Event B bit position
.equ WEX_FDSEVC_bm = 0x10                ; Fault Detection State Event C bit mask
.equ WEX_FDSEVC_bp = 4                   ; Fault Detection State Event C bit position
.equ WEX_BLANKSTATE_bm = 0x80            ; Blanking State bit mask
.equ WEX_BLANKSTATE_bp = 7               ; Blanking State bit position

; WEX_SWAP masks
.equ WEX_SWAP0_bm = 0x01                 ; Swap DTI Output Pair 0 bit mask
.equ WEX_SWAP0_bp = 0                    ; Swap DTI Output Pair 0 bit position
.equ WEX_SWAP1_bm = 0x02                 ; Swap DTI Output Pair 1 bit mask
.equ WEX_SWAP1_bp = 1                    ; Swap DTI Output Pair 1 bit position
.equ WEX_SWAP2_bm = 0x04                 ; Swap DTI Output Pair 2 bit mask
.equ WEX_SWAP2_bp = 2                    ; Swap DTI Output Pair 2 bit position
.equ WEX_SWAP3_bm = 0x08                 ; Swap DTI Output Pair 3 bit mask
.equ WEX_SWAP3_bp = 3                    ; Swap DTI Output Pair 3 bit position

; WEX_PGMOVR masks
.equ WEX_PGMOVR0_bm = 0x01               ; Pattern Generation Override Enable Bit 0 bit mask
.equ WEX_PGMOVR0_bp = 0                  ; Pattern Generation Override Enable Bit 0 bit position
.equ WEX_PGMOVR1_bm = 0x02               ; Pattern Generation Override Enable Bit 1 bit mask
.equ WEX_PGMOVR1_bp = 1                  ; Pattern Generation Override Enable Bit 1 bit position
.equ WEX_PGMOVR2_bm = 0x04               ; Pattern Generation Override Enable Bit 2 bit mask
.equ WEX_PGMOVR2_bp = 2                  ; Pattern Generation Override Enable Bit 2 bit position
.equ WEX_PGMOVR3_bm = 0x08               ; Pattern Generation Override Enable Bit 3 bit mask
.equ WEX_PGMOVR3_bp = 3                  ; Pattern Generation Override Enable Bit 3 bit position
.equ WEX_PGMOVR4_bm = 0x10               ; Pattern Generation Override Enable Bit 4 bit mask
.equ WEX_PGMOVR4_bp = 4                  ; Pattern Generation Override Enable Bit 4 bit position
.equ WEX_PGMOVR5_bm = 0x20               ; Pattern Generation Override Enable Bit 5 bit mask
.equ WEX_PGMOVR5_bp = 5                  ; Pattern Generation Override Enable Bit 5 bit position
.equ WEX_PGMOVR6_bm = 0x40               ; Pattern Generation Override Enable Bit 6 bit mask
.equ WEX_PGMOVR6_bp = 6                  ; Pattern Generation Override Enable Bit 6 bit position
.equ WEX_PGMOVR7_bm = 0x80               ; Pattern Generation Override Enable Bit 7 bit mask
.equ WEX_PGMOVR7_bp = 7                  ; Pattern Generation Override Enable Bit 7 bit position

; WEX_PGMOUT masks
.equ WEX_PGMOUT0_bm = 0x01               ; Pattern Generation Output Value Bit 0 bit mask
.equ WEX_PGMOUT0_bp = 0                  ; Pattern Generation Output Value Bit 0 bit position
.equ WEX_PGMOUT1_bm = 0x02               ; Pattern Generation Output Value Bit 1 bit mask
.equ WEX_PGMOUT1_bp = 1                  ; Pattern Generation Output Value Bit 1 bit position
.equ WEX_PGMOUT2_bm = 0x04               ; Pattern Generation Output Value Bit 2 bit mask
.equ WEX_PGMOUT2_bp = 2                  ; Pattern Generation Output Value Bit 2 bit position
.equ WEX_PGMOUT3_bm = 0x08               ; Pattern Generation Output Value Bit 3 bit mask
.equ WEX_PGMOUT3_bp = 3                  ; Pattern Generation Output Value Bit 3 bit position
.equ WEX_PGMOUT4_bm = 0x10               ; Pattern Generation Output Value Bit 4 bit mask
.equ WEX_PGMOUT4_bp = 4                  ; Pattern Generation Output Value Bit 4 bit position
.equ WEX_PGMOUT5_bm = 0x20               ; Pattern Generation Output Value Bit 5 bit mask
.equ WEX_PGMOUT5_bp = 5                  ; Pattern Generation Output Value Bit 5 bit position
.equ WEX_PGMOUT6_bm = 0x40               ; Pattern Generation Output Value Bit 6 bit mask
.equ WEX_PGMOUT6_bp = 6                  ; Pattern Generation Output Value Bit 6 bit position
.equ WEX_PGMOUT7_bm = 0x80               ; Pattern Generation Output Value Bit 7 bit mask
.equ WEX_PGMOUT7_bp = 7                  ; Pattern Generation Output Value Bit 7 bit position

; WEX_OUTOVEN masks
.equ WEX_OUTOVEN0_bm = 0x01              ; Output Override Enable Bit 0 bit mask
.equ WEX_OUTOVEN0_bp = 0                 ; Output Override Enable Bit 0 bit position
.equ WEX_OUTOVEN1_bm = 0x02              ; Output Override Enable Bit 1 bit mask
.equ WEX_OUTOVEN1_bp = 1                 ; Output Override Enable Bit 1 bit position
.equ WEX_OUTOVEN2_bm = 0x04              ; Output Override Enable Bit 2 bit mask
.equ WEX_OUTOVEN2_bp = 2                 ; Output Override Enable Bit 2 bit position
.equ WEX_OUTOVEN3_bm = 0x08              ; Output Override Enable Bit 3 bit mask
.equ WEX_OUTOVEN3_bp = 3                 ; Output Override Enable Bit 3 bit position
.equ WEX_OUTOVEN4_bm = 0x10              ; Output Override Enable Bit 4 bit mask
.equ WEX_OUTOVEN4_bp = 4                 ; Output Override Enable Bit 4 bit position
.equ WEX_OUTOVEN5_bm = 0x20              ; Output Override Enable Bit 5 bit mask
.equ WEX_OUTOVEN5_bp = 5                 ; Output Override Enable Bit 5 bit position
.equ WEX_OUTOVEN6_bm = 0x40              ; Output Override Enable Bit 6 bit mask
.equ WEX_OUTOVEN6_bp = 6                 ; Output Override Enable Bit 6 bit position
.equ WEX_OUTOVEN7_bm = 0x80              ; Output Override Enable Bit 7 bit mask
.equ WEX_OUTOVEN7_bp = 7                 ; Output Override Enable Bit 7 bit position

; WEX_SWAPBUF masks
.equ WEX_SWAPBUF0_bm = 0x01              ; Swap DTI Output Pair 0 Buffer bit mask
.equ WEX_SWAPBUF0_bp = 0                 ; Swap DTI Output Pair 0 Buffer bit position
.equ WEX_SWAPBUF1_bm = 0x02              ; Swap DTI Output Pair 1 Buffer bit mask
.equ WEX_SWAPBUF1_bp = 1                 ; Swap DTI Output Pair 1 Buffer bit position
.equ WEX_SWAPBUF2_bm = 0x04              ; Swap DTI Output Pair 2 Buffer bit mask
.equ WEX_SWAPBUF2_bp = 2                 ; Swap DTI Output Pair 2 Buffer bit position
.equ WEX_SWAPBUF3_bm = 0x08              ; Swap DTI Output Pair 3 Buffer bit mask
.equ WEX_SWAPBUF3_bp = 3                 ; Swap DTI Output Pair 3 Buffer bit position

