QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB14def.inc
#define LOCKBITS_START 0x1040
#define LOCKBITS_SIZE 0x0004
#define LOCKBITS_END (0x1040 + 0x0004 - 1)
#define LOCKBITS_PAGE_SIZE 0x04

#define FUSES_START 0x1050
#define FUSES_SIZE 0x0010
#define FUSES_END (0x1050 + 0x0010 - 1)
#define FUSES_PAGE_SIZE 0x08

#define SIGNATURES_START 0x1080
#define SIGNATURES_SIZE 0x0003
#define SIGNATURES_END (0x1080 + 0x0003 - 1)
#define SIGNATURES_PAGE_SIZE 0x80

#define PROD_SIGNATURES_START 0x1083
#define PROD_SIGNATURES_SIZE 0x007D
#define PROD_SIGNATURES_END (0x1083 + 0x007D - 1)
#define PROD_SIGNATURES_PAGE_SIZE 0x80

#define BOOTROW_START 0x1100
#define BOOTROW_SIZE 0x0040
#define BOOTROW_END (0x1100 + 0x0040 - 1)
#define BOOTROW_PAGE_SIZE 0x40

#define USER_SIGNATURES_START 0x1200
#define USER_SIGNATURES_SIZE 0x0040
#define USER_SIGNATURES_END (0x1200 + 0x0040 - 1)
#define USER_SIGNATURES_PAGE_SIZE 0x40

#define EEPROM_START 0x1400
#define EEPROM_SIZE 0x0200
#define EEPROM_END (0x1400 + 0x0200 - 1)
#define EEPROM_PAGE_SIZE 0x08

#define INTERNAL_SRAM_START 0x7800
#define INTERNAL_SRAM_SIZE 0x0800
#define INTERNAL_SRAM_END (0x7800 + 0x0800 - 1)

#define MAPPED_PROGMEM_START 0x8000
#define MAPPED_PROGMEM_SIZE 0x4000
#define MAPPED_PROGMEM_END (0x8000 + 0x4000 - 1)
#define MAPPED_PROGMEM_PAGE_SIZE 0x40

#define PROGMEM_START 0x0000
#define PROGMEM_SIZE 0x4000
#define PROGMEM_END (0x0000 + 0x4000 - 1)
#define PROGMEM_PAGE_SIZE 0x40

#define PROGMEM_NRWW_START 0x0000
#define PROGMEM_NRWW_SIZE 0x1000
#define PROGMEM_NRWW_END (0x0000 + 0x1000 - 1)
#define PROGMEM_NRWW_PAGE_SIZE 0x40

#define PROGMEM_RWW_START 0x1000
#define PROGMEM_RWW_SIZE 0x3000
#define PROGMEM_RWW_END (0x1000 + 0x3000 - 1)
#define PROGMEM_RWW_PAGE_SIZE 0x40


; Legacy definitions
.equ    FLASHSTART    = (PROGMEM_START / 2) ; Note: Word address
.equ    FLASHEND      = (PROGMEM_END / 2) ; Note: Word address
.equ    IOEND         = IO_END
.equ    SRAM_START    = INTERNAL_SRAM_START
.equ    SRAM_SIZE     = INTERNAL_SRAM_SIZE
.equ    RAMEND        = INTERNAL_SRAM_END
.equ    E2END         = EEPROM_END
.equ    EEPROMEND     = EEPROM_END


; Definitions used by the assembler
#pragma AVRPART MEMORY PROG_FLASH 0x4000
#pragma AVRPART MEMORY EEPROM 0x0200
#pragma AVRPART MEMORY INT_SRAM SIZE 0x0800
#pragma AVRPART MEMORY INT_SRAM START_ADDR 0x7800

; ***** INTERRUPT VECTORS, ABSOLUTE ADDRESSES ****************************
; NMI interrupt vectors
.equ NMI_vect = 0x0002                   ; 

; BOD interrupt vectors
.equ BOD_VLM_vect = 0x0004               ; 

; RTC interrupt vectors
.equ RTC_CNT_vect = 0x0006               ; 
.equ RTC_PIT_vect = 0x0008               ; 

; CCL interrupt vectors
.equ CCL_CCL_vect = 0x000A               ; 

; PORTA interrupt vectors
.equ PORTA_PORT_vect = 0x000C            ; 

; WEX0 interrupt vectors
.equ WEX0_FAULT_vect = 0x000E            ; 

; TCE0 interrupt vectors
.equ TCE0_OVF_vect = 0x0010              ; 
.equ TCE0_CMP0_vect = 0x0012             ; 
.equ TCE0_CMP1_vect = 0x0014             ; 
.equ TCE0_CMP2_vect = 0x0016             ; 
.equ TCE0_CMP3_vect = 0x0018             ; 

; TCB0 interrupt vectors
.equ TCB0_INT_vect = 0x001A              ; 

; TCB1 interrupt vectors
.equ TCB1_INT_vect = 0x001C              ; 

; TWI0 interrupt vectors
.equ TWI0_TWIS_vect = 0x001E             ; 
.equ TWI0_TWIM_vect = 0x0020             ; 

; SPI0 interrupt vectors
.equ SPI0_INT_vect = 0x0022              ; 

; USART0 interrupt vectors
.equ USART0_RXC_vect = 0x0024            ; 
.equ USART0_DRE_vect = 0x0026            ; 
.equ USART0_TXC_vect = 0x0028            ; 

; PORTD interrupt vectors
.equ PORTD_PORT_vect = 0x002A            ; 

; TCF0 interrupt vectors
.equ TCF0_INT_vect = 0x002C              ; 

; AC0 interrupt vectors
.equ AC0_AC_vect = 0x002E                ; 

; ADC0 interrupt vectors
.equ ADC0_ERROR_vect = 0x0030            ; 
.equ ADC0_RESRDY_vect = 0x0032           ; 
.equ ADC0_SAMPRDY_vect = 0x0034          ; 

; AC1 interrupt vectors
.equ AC1_AC_vect = 0x0036                ; 

; PORTC interrupt vectors
.equ PORTC_PORT_vect = 0x0038            ; 

; PORTF interrupt vectors
.equ PORTF_PORT_vect = 0x003A            ; 

; NVMCTRL interrupt vectors
.equ NVMCTRL_EEREADY_vect = 0x003C       ; 
.equ NVMCTRL_FLREADY_vect = 0x003C       ; 
.equ NVMCTRL_NVMREADY_vect = 0x003C      ; 



; ***** INTERRUPT VECTORS, MODULE BASES **********************************

.equ NMI_vbase = 0x0002
.equ BOD_vbase = 0x0004
.equ RTC_vbase = 0x0006
.equ CCL_vbase = 0x000A
.equ PORTA_vbase = 0x000C
.equ WEX0_vbase = 0x000E
.equ TCE0_vbase = 0x0010
.equ TCB0_vbase = 0x001A
.equ TCB1_vbase = 0x001C
.equ TWI0_vbase = 0x001E
.equ SPI0_vbase = 0x0022
.equ USART0_vbase = 0x0024
.equ PORTD_vbase = 0x002A
.equ TCF0_vbase = 0x002C
.equ AC0_vbase = 0x002E
.equ ADC0_vbase = 0x0030
.equ AC1_vbase = 0x0036
.equ PORTC_vbase = 0x0038
.equ PORTF_vbase = 0x003A
.equ NVMCTRL_vbase = 0x003C


; ***** INTERRUPT VECTORS, VECTOR OFFSETS ********************************

; NMI interrupt vector offsets

.equ NMI_voffset = 0

; BOD interrupt vector offsets

.equ BOD_VLM_voffset = 0

; RTC interrupt vector offsets

.equ RTC_CNT_voffset = 0
.equ RTC_PIT_voffset = 2

; CCL interrupt vector offsets

.equ CCL_CCL_voffset = 0

; PORTA interrupt vector offsets

.equ PORTA_PORT_voffset = 0

; WEX0 interrupt vector offsets

.equ WEX0_FAULT_voffset = 0

; TCE0 interrupt vector offsets

.equ TCE0_OVF_voffset = 0
.equ TCE0_CMP0_voffset = 2
.equ TCE0_CMP1_voffset = 4
.equ TCE0_CMP2_voffset = 6
.equ TCE0_CMP3_voffset = 8

; TCB0 interrupt vector offsets

.equ TCB0_INT_voffset = 0

; TCB1 interrupt vector offsets

.equ TCB1_INT_voffset = 0

; TWI0 interrupt vector offsets

.equ TWI0_TWIS_voffset = 0
.equ TWI0_TWIM_voffset = 2

; SPI0 interrupt vector offsets

.equ SPI0_INT_voffset = 0

; USART0 interrupt vector offsets

.equ USART0_RXC_voffset = 0
.equ USART0_DRE_voffset = 2
.equ USART0_TXC_voffset = 4

; PORTD interrupt vector offsets

.equ PORTD_PORT_voffset = 0

; TCF0 interrupt vector offsets

.equ TCF0_INT_voffset = 0

; AC0 interrupt vector offsets

.equ AC0_AC_voffset = 0

; ADC0 interrupt vector offsets

.equ ADC0_ERROR_voffset = 0
.equ ADC0_RESRDY_voffset = 2
.equ ADC0_SAMPRDY_voffset = 4

; AC1 interrupt vector offsets

.equ AC1_AC_voffset = 0

; PORTC interrupt vector offsets

.equ PORTC_PORT_voffset = 0

; PORTF interrupt vector offsets

.equ PORTF_PORT_voffset = 0

; NVMCTRL interrupt vector offsets

.equ NVMCTRL_EEREADY_voffset = 0
.equ NVMCTRL_FLREADY_voffset = 0
.equ NVMCTRL_NVMREADY_voffset = 0



.equ INT_VECTORS_SIZE = 62 ; size in words


#endif /* _AVR16EB14DEF_INC_ */

; ***** END OF FILE ******************************************************



